https://Daniellem97.app.spacelift.io/stack/opentofu/run/01JVCMW837AQCDT7NRTTZRJJ30 has finished

## Planning logs

```
[01JVB0XQXFJHPMAQSMDHK5XW57] Planning changes with 0 custom hooks...
random_string.example: Refreshing state... [id=--40l=BkgOvV[we]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu will perform the following actions:

  # random_string.example will be destroyed
  # (because random_string.example is not in configuration)
  - resource "random_string" "example" {
      - id          = "--40l=BkgOvV[we" -> null
      - length      = 15 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "--40l=BkgOvV[we" -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # spacelift_stack.stack-1 will be created
  + resource "spacelift_stack" "stack-1" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + enable_local_preview             = false
      + enable_sensitive_outputs_upload  = true
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "Dependencies stack 1"
      + project_root                     = "stack-a"
      + protect_from_deletion            = false
      + repository                       = "stack-dependencies-test"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)
    }

  # spacelift_stack.stack-2 will be created
  + resource "spacelift_stack" "stack-2" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + description                      = "Your first stack managed by Terraform"
      + enable_local_preview             = false
      + enable_sensitive_outputs_upload  = true
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "Dependencies stack 2"
      + project_root                     = "stack-b"
      + protect_from_deletion            = false
      + repository                       = "stack-dependencies-test"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)
    }

  # spacelift_stack.stack-3 will be created
  + resource "spacelift_stack" "stack-3" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + description                      = "Your first stack managed by Terraform"
      + enable_local_preview             = false
      + enable_sensitive_outputs_upload  = true
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "Dependencies stack 3"
      + project_root                     = "stack-c"
      + protect_from_deletion            = false
      + repository                       = "stack-dependencies-test"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)
    }

  # spacelift_stack_dependency.dependency will be created
  + resource "spacelift_stack_dependency" "dependency" {
      + depends_on_stack_id = (known after apply)
      + id                  = (known after apply)
      + stack_id            = (known after apply)
    }

  # spacelift_stack_dependency_reference.reference will be created
  + resource "spacelift_stack_dependency_reference" "reference" {
      + id                  = (known after apply)
      + input_name          = "TF_VAR_APP_DB_URL"
      + output_name         = "DB_CONNECTION_STRING"
      + stack_dependency_id = (known after apply)
      + trigger_always      = false
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - random_string_value = (sensitive value) -> null
[01JVB0XQXFJHPMAQSMDHK5XW57] Changes are GO
[01JVB0XQXFJHPMAQSMDHK5XW57] Uploading the list of managed resources...
[01JVB0XQXFJHPMAQSMDHK5XW57] Please be aware that the run changes calculation includes output changes.
[01JVB0XQXFJHPMAQSMDHK5XW57] Resource list upload is GO
[01JVB0XQXFJHPMAQSMDHK5XW57] Generating JSON representation of the plan...
[01JVB0XQXFJHPMAQSMDHK5XW57] JSON representation is GO
[01JVB0XQXFJHPMAQSMDHK5XW57] Loading custom plan policy inputs...
[01JVB0XQXFJHPMAQSMDHK5XW57] 0 custom plan policy inputs found
[01JVB0XQXFJHPMAQSMDHK5XW57] No plan policies to evaluate
```
